data/ycsb/workloada/75AS1014T9HW/workloada_30/transactions_round5.dat
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:rocksdb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /tmp/ycsb-rocksdb/YCSB/rocksdb/conf:/tmp/ycsb-rocksdb/YCSB/rocksdb/target/rocksdb-binding-0.16.0-SNAPSHOT.jar:/home/ljishen/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/ljishen/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/home/ljishen/.m2/repository/org/rocksdb/rocksdbjni/5.14.3/rocksdbjni-5.14.3.jar:/home/ljishen/.m2/repository/net/jcip/jcip-annotations/1.0/jcip-annotations-1.0.jar:/tmp/ycsb-rocksdb/YCSB/core/target/core-0.16.0-SNAPSHOT.jar:/home/ljishen/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/ljishen/.m2/repository/log4j/log4j/1.2.17/log4j-1.2.17.jar:/home/ljishen/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/ljishen/.m2/repository/org/slf4j/slf4j-log4j12/1.7.25/slf4j-log4j12-1.7.25.jar:/home/ljishen/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P /tmp/ycsb-rocksdb/data/output_myworkloada/myworkloada -p rocksdb.dir=/mnt/sdb1/ycsb-rocksdb-data -t
Command line: -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P /tmp/ycsb-rocksdb/data/output_myworkloada/myworkloada -p rocksdb.dir=/mnt/sdb1/ycsb-rocksdb-data -t
YCSB Client 0.16.0-SNAPSHOT

Loading workload...
Starting test.
0      [      Thread-20] INFO  .ycsb.db.rocksdb.RocksDBClient  - RocksDB data dir: /mnt/sdb1/ycsb-rocksdb-data
2018-10-26 00:15:03:966 0 sec: 0 operations; est completion in 0 second 
305    [      Thread-20] INFO  .ycsb.db.rocksdb.RocksDBClient  - Load column families: [default, usertable] from options file: OPTIONS-046825
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2018-10-26 00:15:13:936 10 sec: 45815 operations; 4581.5 current ops/sec; est completion in 9 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=22940, Max=118591, Min=4, Avg=5825.89, 90=17151, 99=45183, 99.9=77695, 99.99=115903] [SYS_LOAD_AVG: Count=1, Max=18, Min=18, Avg=18, 90=18, 99=18, 99.9=18, 99.99=18] [GCS: Count=1, Max=0, Min=0, Avg=0, 90=0, 99=0, 99.9=0, 99.99=0] [USED_MEM_MB: Count=1, Max=181, Min=181, Avg=181, 90=181, 99=181, 99.9=181, 99.99=181] [UPDATE: Count=22979, Max=123199, Min=35, Avg=5842.86, 90=17407, 99=43871, 99.9=84223, 99.99=118271] [GCS_TIME: Count=1, Max=0, Min=0, Avg=0, 90=0, 99=0, 99.9=0, 99.99=0] 
2018-10-26 00:15:23:937 20 sec: 121062 operations; 7524.7 current ops/sec; est completion in 6 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=37688, Max=585727, Min=3, Avg=3937.16, 90=7815, 99=42943, 99.9=260735, 99.99=463359] [SYS_LOAD_AVG: Count=1, Max=20, Min=20, Avg=20, 90=20, 99=20, 99.9=20, 99.99=20] [GCS: Count=1, Max=2, Min=2, Avg=2, 90=2, 99=2, 99.9=2, 99.99=2] [USED_MEM_MB: Count=1, Max=170, Min=170, Avg=170, 90=170, 99=170, 99.9=170, 99.99=170] [UPDATE: Count=37495, Max=521727, Min=33, Avg=4028.06, 90=8223, 99=45887, 99.9=274687, 99.99=442111] [GCS_TIME: Count=1, Max=11, Min=11, Avg=11, 90=11, 99=11, 99.9=11, 99.99=11] 
2018-10-26 00:15:33:936 30 sec: 149540 operations; 2847.8 current ops/sec; est completion in 8 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=14169, Max=315903, Min=4, Avg=10671.17, 90=33951, 99=106623, 99.9=169983, 99.99=235135] [SYS_LOAD_AVG: Count=1, Max=22, Min=22, Avg=22, 90=22, 99=22, 99.9=22, 99.99=22] [GCS: Count=1, Max=4, Min=4, Avg=4, 90=4, 99=4, 99.9=4, 99.99=4] [USED_MEM_MB: Count=1, Max=56, Min=56, Avg=56, 90=56, 99=56, 99.9=56, 99.99=56] [UPDATE: Count=14279, Max=257663, Min=33, Avg=10416.04, 90=33535, 99=105535, 99.9=164863, 99.99=219647] [GCS_TIME: Count=1, Max=12, Min=12, Avg=12, 90=12, 99=12, 99.9=12, 99.99=12] 
2018-10-26 00:15:43:936 40 sec: 182268 operations; 3272.8 current ops/sec; est completion in 8 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=16373, Max=258815, Min=3, Avg=9013.46, 90=30671, 99=94847, 99.9=171519, 99.99=227455] [SYS_LOAD_AVG: Count=1, Max=24, Min=24, Avg=24, 90=24, 99=24, 99.9=24, 99.99=24] [GCS: Count=1, Max=1, Min=1, Avg=1, 90=1, 99=1, 99.9=1, 99.99=1] [USED_MEM_MB: Count=1, Max=143, Min=143, Avg=143, 90=143, 99=143, 99.9=143, 99.99=143] [UPDATE: Count=16418, Max=261759, Min=34, Avg=9284.53, 90=30639, 99=101119, 99.9=179839, 99.99=224895] [GCS_TIME: Count=1, Max=3, Min=3, Avg=3, 90=3, 99=3, 99.9=3, 99.99=3] 
2018-10-26 00:15:53:936 50 sec: 233556 operations; 5128.8 current ops/sec; est completion in 8 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=25596, Max=303615, Min=3, Avg=5854.98, 90=17583, 99=84095, 99.9=163455, 99.99=279807] [SYS_LOAD_AVG: Count=1, Max=26, Min=26, Avg=26, 90=26, 99=26, 99.9=26, 99.99=26] [GCS: Count=1, Max=2, Min=2, Avg=2, 90=2, 99=2, 99.9=2, 99.99=2] [USED_MEM_MB: Count=1, Max=56, Min=56, Avg=56, 90=56, 99=56, 99.9=56, 99.99=56] [UPDATE: Count=25619, Max=304639, Min=33, Avg=5751.23, 90=17631, 99=81343, 99.9=147711, 99.99=243455] [GCS_TIME: Count=1, Max=4, Min=4, Avg=4, 90=4, 99=4, 99.9=4, 99.99=4] 
2018-10-26 00:16:03:936 60 sec: 350860 operations; 11730.4 current ops/sec; est completion in 6 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=58337, Max=653823, Min=3, Avg=2590.09, 90=2799, 99=37471, 99.9=306687, 99.99=508927] [SYS_LOAD_AVG: Count=1, Max=27, Min=27, Avg=27, 90=27, 99=27, 99.9=27, 99.99=27] [GCS: Count=1, Max=2, Min=2, Avg=2, 90=2, 99=2, 99.9=2, 99.99=2] [USED_MEM_MB: Count=1, Max=194, Min=194, Avg=194, 90=194, 99=194, 99.9=194, 99.99=194] [UPDATE: Count=58967, Max=605695, Min=31, Avg=2551.19, 90=2881, 99=35551, 99.9=291327, 99.99=514303] [GCS_TIME: Count=1, Max=8, Min=8, Avg=8, 90=8, 99=8, 99.9=8, 99.99=8] 
2018-10-26 00:16:13:937 70 sec: 475830 operations; 12497 current ops/sec; est completion in 5 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=62525, Max=693247, Min=3, Avg=2394.9, 90=2373, 99=45759, 99.9=235519, 99.99=402943] [SYS_LOAD_AVG: Count=1, Max=28, Min=28, Avg=28, 90=28, 99=28, 99.9=28, 99.99=28] [GCS: Count=1, Max=7, Min=7, Avg=7, 90=7, 99=7, 99.9=7, 99.99=7] [USED_MEM_MB: Count=1, Max=124, Min=124, Avg=124, 90=124, 99=124, 99.9=124, 99.99=124] [UPDATE: Count=62445, Max=690175, Min=32, Avg=2399.42, 90=2463, 99=44031, 99.9=212223, 99.99=436223] [GCS_TIME: Count=1, Max=10, Min=10, Avg=10, 90=10, 99=10, 99.9=10, 99.99=10] 
2018-10-26 00:16:23:936 80 sec: 503970 operations; 2814 current ops/sec; est completion in 5 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=14047, Max=376831, Min=4, Avg=10870.72, 90=39807, 99=134015, 99.9=217727, 99.99=310527] [SYS_LOAD_AVG: Count=1, Max=30, Min=30, Avg=30, 90=30, 99=30, 99.9=30, 99.99=30] [GCS: Count=1, Max=8, Min=8, Avg=8, 90=8, 99=8, 99.9=8, 99.99=8] [USED_MEM_MB: Count=1, Max=161, Min=161, Avg=161, 90=161, 99=161, 99.9=161, 99.99=161] [UPDATE: Count=14099, Max=259583, Min=34, Avg=10447.4, 90=38303, 99=128895, 99.9=222975, 99.99=254591] [GCS_TIME: Count=1, Max=11, Min=11, Avg=11, 90=11, 99=11, 99.9=11, 99.99=11] 
2018-10-26 00:16:33:936 90 sec: 535415 operations; 3144.5 current ops/sec; est completion in 5 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=15797, Max=347647, Min=3, Avg=9515.77, 90=33535, 99=122879, 99.9=215679, 99.99=281343] [SYS_LOAD_AVG: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [GCS: Count=1, Max=3, Min=3, Avg=3, 90=3, 99=3, 99.9=3, 99.99=3] [USED_MEM_MB: Count=1, Max=17, Min=17, Avg=17, 90=17, 99=17, 99.9=17, 99.99=17] [UPDATE: Count=15645, Max=365055, Min=34, Avg=9558.02, 90=33471, 99=124799, 99.9=241279, 99.99=331263] [GCS_TIME: Count=1, Max=7, Min=7, Avg=7, 90=7, 99=7, 99.9=7, 99.99=7] 
2018-10-26 00:16:43:936 100 sec: 566655 operations; 3124 current ops/sec; est completion in 6 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=15662, Max=507647, Min=3, Avg=9775.4, 90=28927, 99=162943, 99.9=308223, 99.99=457727] [SYS_LOAD_AVG: Count=1, Max=34, Min=34, Avg=34, 90=34, 99=34, 99.9=34, 99.99=34] [GCS: Count=1, Max=2, Min=2, Avg=2, 90=2, 99=2, 99.9=2, 99.99=2] [USED_MEM_MB: Count=1, Max=75, Min=75, Avg=75, 90=75, 99=75, 99.9=75, 99.99=75] [UPDATE: Count=15602, Max=733695, Min=32, Avg=9427.08, 90=26719, 99=159743, 99.9=325375, 99.99=608255] [GCS_TIME: Count=1, Max=5, Min=5, Avg=5, 90=5, 99=5, 99.9=5, 99.99=5] 
2018-10-26 00:16:53:936 110 sec: 631793 operations; 6513.8 current ops/sec; est completion in 5 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=32751, Max=631295, Min=3, Avg=4567.25, 90=9279, 99=82303, 99.9=271103, 99.99=452863] [SYS_LOAD_AVG: Count=1, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [GCS: Count=1, Max=2, Min=2, Avg=2, 90=2, 99=2, 99.9=2, 99.99=2] [USED_MEM_MB: Count=1, Max=141, Min=141, Avg=141, 90=141, 99=141, 99.9=141, 99.99=141] [UPDATE: Count=32360, Max=601087, Min=32, Avg=4641.33, 90=8815, 99=82495, 99.9=286207, 99.99=477695] [GCS_TIME: Count=1, Max=6, Min=6, Avg=6, 90=6, 99=6, 99.9=6, 99.99=6] 
2018-10-26 00:17:03:936 120 sec: 799733 operations; 16794 current ops/sec; est completion in 4 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=83682, Max=739327, Min=3, Avg=1755.64, 90=1374, 99=24399, 99.9=281855, 99.99=475903] [SYS_LOAD_AVG: Count=1, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [GCS: Count=1, Max=6, Min=6, Avg=6, 90=6, 99=6, 99.9=6, 99.99=6] [USED_MEM_MB: Count=1, Max=69, Min=69, Avg=69, 90=69, 99=69, 99.9=69, 99.99=69] [UPDATE: Count=84258, Max=594431, Min=33, Avg=1772.44, 90=1549, 99=23775, 99.9=259839, 99.99=470015] [GCS_TIME: Count=1, Max=20, Min=20, Avg=20, 90=20, 99=20, 99.9=20, 99.99=20] 
2018-10-26 00:17:13:936 130 sec: 921428 operations; 12169.5 current ops/sec; est completion in 3 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=60858, Max=610303, Min=3, Avg=2286, 90=1066, 99=63199, 99.9=253567, 99.99=425983] [SYS_LOAD_AVG: Count=1, Max=34, Min=34, Avg=34, 90=34, 99=34, 99.9=34, 99.99=34] [GCS: Count=1, Max=17, Min=17, Avg=17, 90=17, 99=17, 99.9=17, 99.99=17] [USED_MEM_MB: Count=1, Max=25, Min=25, Avg=25, 90=25, 99=25, 99.9=25, 99.99=25] [UPDATE: Count=60837, Max=671231, Min=33, Avg=2647.72, 90=1314, 99=72255, 99.9=261887, 99.99=434943] [GCS_TIME: Count=1, Max=23, Min=23, Avg=23, 90=23, 99=23, 99.9=23, 99.99=23] 
2018-10-26 00:17:23:936 140 sec: 930006 operations; 857.8 current ops/sec; est completion in 4 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=4343, Max=897023, Min=3, Avg=34923.18, 90=134783, 99=483583, 99.9=717311, 99.99=897023] [SYS_LOAD_AVG: Count=1, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [GCS: Count=1, Max=14, Min=14, Avg=14, 90=14, 99=14, 99.9=14, 99.99=14] [USED_MEM_MB: Count=1, Max=71, Min=71, Avg=71, 90=71, 99=71, 99.9=71, 99.99=71] [UPDATE: Count=4239, Max=902655, Min=35, Avg=35306.07, 90=134783, 99=471039, 99.9=759807, 99.99=902655] [GCS_TIME: Count=1, Max=18, Min=18, Avg=18, 90=18, 99=18, 99.9=18, 99.99=18] 
2018-10-26 00:17:33:939 150 sec: 942195 operations; 1218.9 current ops/sec; est completion in 4 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=6018, Max=1108991, Min=3, Avg=24665.4, 90=81023, 99=378623, 99.9=990719, 99.99=1097727] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=1, Min=1, Avg=1, 90=1, 99=1, 99.9=1, 99.99=1] [USED_MEM_MB: Count=1, Max=82, Min=82, Avg=82, 90=82, 99=82, 99.9=82, 99.99=82] [UPDATE: Count=6167, Max=1076223, Min=35, Avg=24140.14, 90=77759, 99=380415, 99.9=969215, 99.99=1005055] [GCS_TIME: Count=1, Max=2, Min=2, Avg=2, 90=2, 99=2, 99.9=2, 99.99=2] 
2018-10-26 00:17:43:936 160 sec: 1027251 operations; 8505.6 current ops/sec; est completion in 4 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=42683, Max=856063, Min=3, Avg=3348.68, 90=3367, 99=54559, 99.9=361215, 99.99=579583] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=2, Min=2, Avg=2, 90=2, 99=2, 99.9=2, 99.99=2] [USED_MEM_MB: Count=1, Max=51, Min=51, Avg=51, 90=51, 99=51, 99.9=51, 99.99=51] [UPDATE: Count=42373, Max=873471, Min=32, Avg=3634.53, 90=3729, 99=55775, 99.9=401407, 99.99=582655] [GCS_TIME: Count=1, Max=5, Min=5, Avg=5, 90=5, 99=5, 99.9=5, 99.99=5] 
2018-10-26 00:17:53:936 170 sec: 1142323 operations; 11507.2 current ops/sec; est completion in 3 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=57472, Max=987647, Min=3, Avg=2606.66, 90=1804, 99=58591, 99.9=226943, 99.99=602623] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=12, Min=12, Avg=12, 90=12, 99=12, 99.9=12, 99.99=12] [USED_MEM_MB: Count=1, Max=46, Min=46, Avg=46, 90=46, 99=46, 99.9=46, 99.99=46] [UPDATE: Count=57600, Max=632319, Min=32, Avg=2646.13, 90=2185, 99=56191, 99.9=198527, 99.99=501503] [GCS_TIME: Count=1, Max=19, Min=19, Avg=19, 90=19, 99=19, 99.9=19, 99.99=19] 
2018-10-26 00:18:03:936 180 sec: 1258420 operations; 11609.7 current ops/sec; est completion in 3 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=58006, Max=628735, Min=3, Avg=2430.21, 90=1154, 99=51903, 99.9=294399, 99.99=538623] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=18, Min=18, Avg=18, 90=18, 99=18, 99.9=18, 99.99=18] [USED_MEM_MB: Count=1, Max=37, Min=37, Avg=37, 90=37, 99=37, 99.9=37, 99.99=37] [UPDATE: Count=58091, Max=601599, Min=32, Avg=2715.31, 90=1655, 99=60063, 99.9=305151, 99.99=536575] [GCS_TIME: Count=1, Max=31, Min=31, Avg=31, 90=31, 99=31, 99.9=31, 99.99=31] 
2018-10-26 00:18:13:936 190 sec: 1379714 operations; 12129.4 current ops/sec; est completion in 2 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=60568, Max=1035263, Min=3, Avg=2516.53, 90=939, 99=54687, 99.9=315135, 99.99=715775] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=20, Min=20, Avg=20, 90=20, 99=20, 99.9=20, 99.99=20] [USED_MEM_MB: Count=1, Max=72, Min=72, Avg=72, 90=72, 99=72, 99.9=72, 99.99=72] [UPDATE: Count=60726, Max=779263, Min=31, Avg=2489.05, 90=1411, 99=51039, 99.9=282623, 99.99=613887] [GCS_TIME: Count=1, Max=28, Min=28, Avg=28, 90=28, 99=28, 99.9=28, 99.99=28] 
2018-10-26 00:18:23:936 200 sec: 1531197 operations; 15148.3 current ops/sec; est completion in 2 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=75870, Max=808447, Min=3, Avg=1880.92, 90=476, 99=57119, 99.9=221055, 99.99=604159] [SYS_LOAD_AVG: Count=1, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [GCS: Count=1, Max=19, Min=19, Avg=19, 90=19, 99=19, 99.9=19, 99.99=19] [USED_MEM_MB: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [UPDATE: Count=75742, Max=799231, Min=33, Avg=2090.04, 90=818, 99=59167, 99.9=230399, 99.99=510207] [GCS_TIME: Count=1, Max=29, Min=29, Avg=29, 90=29, 99=29, 99.9=29, 99.99=29] 
2018-10-26 00:18:33:936 210 sec: 1653907 operations; 12271 current ops/sec; est completion in 2 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=61308, Max=691711, Min=3, Avg=2369.18, 90=435, 99=64319, 99.9=319487, 99.99=530943] [SYS_LOAD_AVG: Count=1, Max=34, Min=34, Avg=34, 90=34, 99=34, 99.9=34, 99.99=34] [GCS: Count=1, Max=15, Min=15, Avg=15, 90=15, 99=15, 99.9=15, 99.99=15] [USED_MEM_MB: Count=1, Max=178, Min=178, Avg=178, 90=178, 99=178, 99.9=178, 99.99=178] [UPDATE: Count=61291, Max=581119, Min=32, Avg=2499.62, 90=818, 99=65119, 99.9=295935, 99.99=515839] [GCS_TIME: Count=1, Max=22, Min=22, Avg=22, 90=22, 99=22, 99.9=22, 99.99=22] 
2018-10-26 00:18:43:936 220 sec: 1674990 operations; 2108.3 current ops/sec; est completion in 2 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=10506, Max=757759, Min=3, Avg=13632.62, 90=18399, 99=267775, 99.9=506367, 99.99=703487] [SYS_LOAD_AVG: Count=1, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [GCS: Count=1, Max=9, Min=9, Avg=9, 90=9, 99=9, 99.9=9, 99.99=9] [USED_MEM_MB: Count=1, Max=148, Min=148, Avg=148, 90=148, 99=148, 99.9=148, 99.99=148] [UPDATE: Count=10559, Max=627711, Min=31, Avg=14827.56, 90=34175, 99=278783, 99.9=520191, 99.99=625151] [GCS_TIME: Count=1, Max=13, Min=13, Avg=13, 90=13, 99=13, 99.9=13, 99.99=13] 
2018-10-26 00:18:53:936 230 sec: 1789613 operations; 11462.3 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=56996, Max=629247, Min=3, Avg=2631.12, 90=204, 99=69055, 99.9=299007, 99.99=428543] [SYS_LOAD_AVG: Count=1, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [GCS: Count=1, Max=2, Min=2, Avg=2, 90=2, 99=2, 99.9=2, 99.99=2] [USED_MEM_MB: Count=1, Max=106, Min=106, Avg=106, 90=106, 99=106, 99.9=106, 99.99=106] [UPDATE: Count=57678, Max=669183, Min=32, Avg=2616.66, 90=1507, 99=60287, 99.9=284159, 99.99=489983] [GCS_TIME: Count=1, Max=6, Min=6, Avg=6, 90=6, 99=6, 99.9=6, 99.99=6] 
2018-10-26 00:19:03:936 240 sec: 1934508 operations; 14489.5 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=72558, Max=630783, Min=3, Avg=1975.76, 90=146, 99=42687, 99.9=248319, 99.99=602111] [SYS_LOAD_AVG: Count=1, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [GCS: Count=1, Max=10, Min=10, Avg=10, 90=10, 99=10, 99.9=10, 99.99=10] [USED_MEM_MB: Count=1, Max=113, Min=113, Avg=113, 90=113, 99=113, 99.9=113, 99.99=113] [UPDATE: Count=72286, Max=986111, Min=30, Avg=2134.72, 90=742, 99=42335, 99.9=248319, 99.99=591871] [GCS_TIME: Count=1, Max=50, Min=50, Avg=50, 90=50, 99=50, 99.9=50, 99.99=50] 
2018-10-26 00:19:13:936 250 sec: 2044804 operations; 11029.6 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=54810, Max=416511, Min=3, Avg=2613.75, 90=165, 99=77311, 99.9=247551, 99.99=374015] [SYS_LOAD_AVG: Count=1, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [GCS: Count=1, Max=15, Min=15, Avg=15, 90=15, 99=15, 99.9=15, 99.99=15] [USED_MEM_MB: Count=1, Max=112, Min=112, Avg=112, 90=112, 99=112, 99.9=112, 99.99=112] [UPDATE: Count=55486, Max=423935, Min=31, Avg=2825.51, 90=809, 99=82687, 99.9=245375, 99.99=339967] [GCS_TIME: Count=1, Max=22, Min=22, Avg=22, 90=22, 99=22, 99.9=22, 99.99=22] 
2018-10-26 00:19:23:936 260 sec: 2077549 operations; 3274.5 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=16409, Max=446207, Min=3, Avg=9173.14, 90=185, 99=197247, 99.9=348159, 99.99=426495] [SYS_LOAD_AVG: Count=1, Max=34, Min=34, Avg=34, 90=34, 99=34, 99.9=34, 99.99=34] [GCS: Count=1, Max=14, Min=14, Avg=14, 90=14, 99=14, 99.9=14, 99.99=14] [USED_MEM_MB: Count=1, Max=69, Min=69, Avg=69, 90=69, 99=69, 99.9=69, 99.99=69] [UPDATE: Count=16336, Max=510975, Min=32, Avg=9044.75, 90=751, 99=200191, 99.9=374271, 99.99=484351] [GCS_TIME: Count=1, Max=19, Min=19, Avg=19, 90=19, 99=19, 99.9=19, 99.99=19] 
2018-10-26 00:19:33:936 270 sec: 2102274 operations; 2472.5 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=12334, Max=842239, Min=3, Avg=12195.87, 90=159, 99=260223, 99.9=734719, 99.99=780799] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=5, Min=5, Avg=5, 90=5, 99=5, 99.9=5, 99.99=5] [USED_MEM_MB: Count=1, Max=25, Min=25, Avg=25, 90=25, 99=25, 99.9=25, 99.99=25] [UPDATE: Count=12391, Max=813055, Min=30, Avg=11920.78, 90=521, 99=266495, 99.9=695295, 99.99=812543] [GCS_TIME: Count=1, Max=8, Min=8, Avg=8, 90=8, 99=8, 99.9=8, 99.99=8] 
2018-10-26 00:19:43:936 280 sec: 2129939 operations; 2766.5 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=13884, Max=593919, Min=3, Avg=10779.2, 90=161, 99=252287, 99.9=487423, 99.99=573951] [SYS_LOAD_AVG: Count=1, Max=37, Min=37, Avg=37, 90=37, 99=37, 99.9=37, 99.99=37] [GCS: Count=1, Max=3, Min=3, Avg=3, 90=3, 99=3, 99.9=3, 99.99=3] [USED_MEM_MB: Count=1, Max=66, Min=66, Avg=66, 90=66, 99=66, 99.9=66, 99.99=66] [UPDATE: Count=13800, Max=792575, Min=32, Avg=11178.07, 90=433, 99=252287, 99.9=490239, 99.99=673279] [GCS_TIME: Count=1, Max=5, Min=5, Avg=5, 90=5, 99=5, 99.9=5, 99.99=5] 
2018-10-26 00:19:53:936 290 sec: 2250274 operations; 12033.5 current ops/sec; est completion in 47 seconds [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=60321, Max=879615, Min=3, Avg=2424.69, 90=128, 99=76415, 99.9=250623, 99.99=627199] [SYS_LOAD_AVG: Count=1, Max=37, Min=37, Avg=37, 90=37, 99=37, 99.9=37, 99.99=37] [GCS: Count=1, Max=4, Min=4, Avg=4, 90=4, 99=4, 99.9=4, 99.99=4] [USED_MEM_MB: Count=1, Max=67, Min=67, Avg=67, 90=67, 99=67, 99.9=67, 99.99=67] [UPDATE: Count=60278, Max=716799, Min=32, Avg=2561.29, 90=711, 99=74367, 99.9=258559, 99.99=627199] [GCS_TIME: Count=1, Max=5, Min=5, Avg=5, 90=5, 99=5, 99.9=5, 99.99=5] 
2018-10-26 00:20:03:936 300 sec: 2377793 operations; 12751.9 current ops/sec; est completion in 30 seconds [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=63646, Max=1506303, Min=3, Avg=2067.41, 90=144, 99=46783, 99.9=248319, 99.99=1359871] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=16, Min=16, Avg=16, 90=16, 99=16, 99.9=16, 99.99=16] [USED_MEM_MB: Count=1, Max=57, Min=57, Avg=57, 90=57, 99=57, 99.9=57, 99.99=57] [UPDATE: Count=63599, Max=1504255, Min=32, Avg=2613.34, 90=733, 99=58591, 99.9=277503, 99.99=1452031] [GCS_TIME: Count=1, Max=30, Min=30, Avg=30, 90=30, 99=30, 99.9=30, 99.99=30] 
2018-10-26 00:20:13:936 310 sec: 2416729 operations; 3893.6 current ops/sec; est completion in 25 seconds [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=19574, Max=468735, Min=3, Avg=7897.6, 90=134, 99=177919, 99.9=280319, 99.99=419583] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=13, Min=13, Avg=13, 90=13, 99=13, 99.9=13, 99.99=13] [USED_MEM_MB: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [UPDATE: Count=19353, Max=370943, Min=31, Avg=7405.94, 90=406, 99=169087, 99.9=286207, 99.99=344575] [GCS_TIME: Count=1, Max=20, Min=20, Avg=20, 90=20, 99=20, 99.9=20, 99.99=20] 
2018-10-26 00:20:23:936 320 sec: 2548591 operations; 13186.2 current ops/sec; est completion in 8 second [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=65976, Max=464383, Min=3, Avg=2302.57, 90=114, 99=54047, 99.9=253951, 99.99=384255] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=3, Min=3, Avg=3, 90=3, 99=3, 99.9=3, 99.99=3] [USED_MEM_MB: Count=1, Max=115, Min=115, Avg=115, 90=115, 99=115, 99.9=115, 99.99=115] [CLEANUP: Count=1, Max=41, Min=41, Avg=41, 90=41, 99=41, 99.9=41, 99.99=41] [UPDATE: Count=65886, Max=464127, Min=32, Avg=2290.1, 90=412, 99=50527, 99.9=252927, 99.99=384767] [GCS_TIME: Count=1, Max=5, Min=5, Avg=5, 90=5, 99=5, 99.9=5, 99.99=5] 
2018-10-26 00:20:30:563 326 sec: 2611239 operations; 9453.45 current ops/sec; [THREAD_COUNT: Count=2, Max=31, Min=2, Avg=16.5, 90=31, 99=31, 99.9=31, 99.99=31] [READ: Count=31344, Max=485887, Min=3, Avg=1967.48, 90=123, 99=46143, 99.9=240895, 99.99=409599] [SYS_LOAD_AVG: Count=2, Max=36, Min=35, Avg=35.5, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=2, Max=14, Min=8, Avg=11, 90=14, 99=14, 99.9=14, 99.99=14] [USED_MEM_MB: Count=2, Max=97, Min=47, Avg=72, 90=97, 99=97, 99.9=97, 99.99=97] [CLEANUP: Count=29, Max=551935, Min=1, Avg=19028.83, 90=9, 99=551935, 99.9=551935, 99.99=551935] [UPDATE: Count=31304, Max=418303, Min=33, Avg=2236.82, 90=426, 99=59519, 99.9=256895, 99.99=371455] [GCS_TIME: Count=2, Max=24, Min=14, Avg=19, 90=24, 99=24, 99.9=24, 99.99=24] 
[OVERALL], RunTime(ms), 326627
[OVERALL], Throughput(ops/sec), 7994.559543454767
[TOTAL_GCS_PS_Scavenge], Count, 273
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 495
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.1515490146252453
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 273
[TOTAL_GC_TIME], Time(ms), 495
[TOTAL_GC_TIME_%], Time(%), 0.1515490146252453
[MAX_MEM_USED], MBs, 194
[MIN_MEM_USED], MBs, 17
[MAX_THREADS], Count, 32
[MIN_THREADS], Count, 2
[MAX_SYS_LOAD_AVG], Load, 37.6
[MIN_SYS_LOAD_AVG], Load, 18.03
[THREAD_COUNT], Operations, 34
[THREAD_COUNT], AverageLatency(us), 31.08823529411765
[THREAD_COUNT], MinLatency(us), 2
[THREAD_COUNT], MaxLatency(us), 32
[THREAD_COUNT], 95thPercentileLatency(us), 32
[THREAD_COUNT], 99thPercentileLatency(us), 32
[READ], Operations, 1305051
[READ], AverageLatency(us), 3657.9936270689805
[READ], MinLatency(us), 3
[READ], MaxLatency(us), 1506303
[READ], 95thPercentileLatency(us), 13319
[READ], 99thPercentileLatency(us), 91839
[READ], Return=OK, 1305051
[SYS_LOAD_AVG], Operations, 34
[SYS_LOAD_AVG], AverageLatency(us), 32.705882352941174
[SYS_LOAD_AVG], MinLatency(us), 18
[SYS_LOAD_AVG], MaxLatency(us), 37
[SYS_LOAD_AVG], 95thPercentileLatency(us), 36
[SYS_LOAD_AVG], 99thPercentileLatency(us), 37
[GCS], Operations, 34
[GCS], AverageLatency(us), 8.029411764705882
[GCS], MinLatency(us), 0
[GCS], MaxLatency(us), 20
[GCS], 95thPercentileLatency(us), 18
[GCS], 99thPercentileLatency(us), 20
[USED_MEM_MB], Operations, 34
[USED_MEM_MB], AverageLatency(us), 89.5
[USED_MEM_MB], MinLatency(us), 17
[USED_MEM_MB], MaxLatency(us), 194
[USED_MEM_MB], 95thPercentileLatency(us), 178
[USED_MEM_MB], 99thPercentileLatency(us), 194
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 18395.9
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 551935
[CLEANUP], 95thPercentileLatency(us), 41
[CLEANUP], 99thPercentileLatency(us), 551935
[UPDATE], Operations, 1306188
[UPDATE], AverageLatency(us), 3764.4476109105276
[UPDATE], MinLatency(us), 30
[UPDATE], MaxLatency(us), 1504255
[UPDATE], 95thPercentileLatency(us), 13351
[UPDATE], 99thPercentileLatency(us), 91327
[UPDATE], Return=OK, 1306188
[GCS_TIME], Operations, 34
[GCS_TIME], AverageLatency(us), 14.558823529411764
[GCS_TIME], MinLatency(us), 0
[GCS_TIME], MaxLatency(us), 50
[GCS_TIME], 95thPercentileLatency(us), 30
[GCS_TIME], 99thPercentileLatency(us), 50